OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/incompressible/simpleFoam/T3A/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss linearUpwind grad;

    div(phi,k)          bounded Gauss linearUpwind grad;
    div(phi,omega)      bounded Gauss linearUpwind grad;
    div(phi,gammaInt)   bounded Gauss linearUpwind grad;
    div(phi,ReThetat)   bounded Gauss linearUpwind grad;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
